http-benchmarks/output/run-httpserv_go-40000-1000.txt
Running 1m test @ http://localhost:8080
  24 threads and 1000 connections
  Thread calibration: mean lat.: 845.462ms, rate sampling interval: 3317ms
  Thread calibration: mean lat.: 967.189ms, rate sampling interval: 3604ms
  Thread calibration: mean lat.: 998.125ms, rate sampling interval: 3706ms
  Thread calibration: mean lat.: 953.772ms, rate sampling interval: 3622ms
  Thread calibration: mean lat.: 938.423ms, rate sampling interval: 3600ms
  Thread calibration: mean lat.: 818.384ms, rate sampling interval: 3104ms
  Thread calibration: mean lat.: 961.076ms, rate sampling interval: 3622ms
  Thread calibration: mean lat.: 987.475ms, rate sampling interval: 3676ms
  Thread calibration: mean lat.: 936.654ms, rate sampling interval: 3559ms
  Thread calibration: mean lat.: 951.262ms, rate sampling interval: 3543ms
  Thread calibration: mean lat.: 933.815ms, rate sampling interval: 3534ms
  Thread calibration: mean lat.: 923.687ms, rate sampling interval: 3491ms
  Thread calibration: mean lat.: 875.502ms, rate sampling interval: 3426ms
  Thread calibration: mean lat.: 888.907ms, rate sampling interval: 3448ms
  Thread calibration: mean lat.: 743.802ms, rate sampling interval: 2983ms
  Thread calibration: mean lat.: 925.481ms, rate sampling interval: 3536ms
  Thread calibration: mean lat.: 877.917ms, rate sampling interval: 3397ms
  Thread calibration: mean lat.: 913.605ms, rate sampling interval: 3524ms
  Thread calibration: mean lat.: 863.653ms, rate sampling interval: 3407ms
  Thread calibration: mean lat.: 876.777ms, rate sampling interval: 3354ms
  Thread calibration: mean lat.: 839.396ms, rate sampling interval: 3315ms
  Thread calibration: mean lat.: 845.331ms, rate sampling interval: 3397ms
  Thread calibration: mean lat.: 828.297ms, rate sampling interval: 3250ms
  Thread calibration: mean lat.: 906.651ms, rate sampling interval: 3358ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.49s     2.90s   13.23s    59.55%
    Req/Sec     1.35k    16.16     1.44k    73.51%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.38s 
 75.000%    8.86s 
 90.000%   10.56s 
 99.000%   12.23s 
 99.900%   12.80s 
 99.990%   13.03s 
 99.999%   13.14s 
100.000%   13.24s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     957.439     0.000000            1         1.00
    2652.159     0.100000       161387         1.11
    3543.039     0.200000       322618         1.25
    4456.447     0.300000       484239         1.43
    5410.815     0.400000       645331         1.67
    6381.567     0.500000       806550         2.00
    6864.895     0.550000       886974         2.22
    7348.223     0.600000       967071         2.50
    7843.839     0.650000      1047689         2.86
    8347.647     0.700000      1128758         3.33
    8855.551     0.750000      1209077         4.00
    9117.695     0.775000      1249590         4.44
    9388.031     0.800000      1290400         5.00
    9666.559     0.825000      1330762         5.71
    9953.279     0.850000      1370984         6.67
   10239.999     0.875000      1410526         8.00
   10395.647     0.887500      1431009         8.89
   10559.487     0.900000      1451570        10.00
   10723.327     0.912500      1471234        11.43
   10895.359     0.925000      1491004        13.33
   11083.775     0.937500      1511111        16.00
   11190.271     0.943750      1521785        17.78
   11288.575     0.950000      1531213        20.00
   11403.263     0.956250      1541603        22.86
   11517.951     0.962500      1551617        26.67
   11640.831     0.968750      1561603        32.00
   11706.367     0.971875      1566504        35.56
   11780.095     0.975000      1571675        40.00
   11862.015     0.978125      1576891        45.71
   11943.935     0.981250      1581782        53.33
   12034.047     0.984375      1586689        64.00
   12083.199     0.985938      1589195        71.11
   12132.351     0.987500      1591633        80.00
   12189.695     0.989062      1594234        91.43
   12255.231     0.990625      1596946       106.67
   12320.767     0.992188      1599325       128.00
   12361.727     0.992969      1600701       142.22
   12394.495     0.993750      1601711       160.00
   12435.455     0.994531      1602958       182.86
   12484.607     0.995313      1604300       213.33
   12533.759     0.996094      1605574       256.00
   12558.335     0.996484      1606152       284.44
   12591.103     0.996875      1606870       320.00
   12615.679     0.997266      1607370       365.71
   12648.447     0.997656      1607984       426.67
   12689.407     0.998047      1608708       512.00
   12705.791     0.998242      1608977       568.89
   12730.367     0.998437      1609340       640.00
   12746.751     0.998633      1609572       731.43
   12771.327     0.998828      1609884       853.33
   12804.095     0.999023      1610244      1024.00
   12820.479     0.999121      1610396      1137.78
   12836.863     0.999219      1610545      1280.00
   12853.247     0.999316      1610685      1462.86
   12869.631     0.999414      1610828      1706.67
   12894.207     0.999512      1610985      2048.00
   12910.591     0.999561      1611095      2275.56
   12918.783     0.999609      1611144      2560.00
   12935.167     0.999658      1611238      2925.71
   12943.359     0.999707      1611286      3413.33
   12959.743     0.999756      1611365      4096.00
   12967.935     0.999780      1611404      4551.11
   12984.319     0.999805      1611470      5120.00
   12992.511     0.999829      1611494      5851.43
   13000.703     0.999854      1611525      6826.67
   13008.895     0.999878      1611562      8192.00
   13017.087     0.999890      1611592      9102.22
   13025.279     0.999902      1611617     10240.00
   13033.471     0.999915      1611642     11702.86
   13033.471     0.999927      1611642     13653.33
   13049.855     0.999939      1611669     16384.00
   13058.047     0.999945      1611683     18204.44
   13058.047     0.999951      1611683     20480.00
   13066.239     0.999957      1611695     23405.71
   13074.431     0.999963      1611703     27306.67
   13082.623     0.999969      1611711     32768.00
   13090.815     0.999973      1611716     36408.89
   13099.007     0.999976      1611723     40960.00
   13107.199     0.999979      1611728     46811.43
   13115.391     0.999982      1611734     54613.33
   13115.391     0.999985      1611734     65536.00
   13123.583     0.999986      1611739     72817.78
   13123.583     0.999988      1611739     81920.00
   13139.967     0.999989      1611743     93622.86
   13148.159     0.999991      1611747    109226.67
   13148.159     0.999992      1611747    131072.00
   13148.159     0.999993      1611747    145635.56
   13172.735     0.999994      1611749    163840.00
   13180.927     0.999995      1611751    187245.71
   13180.927     0.999995      1611751    218453.33
   13189.119     0.999996      1611752    262144.00
   13197.311     0.999997      1611753    291271.11
   13205.503     0.999997      1611754    327680.00
   13205.503     0.999997      1611754    374491.43
   13213.695     0.999998      1611755    436906.67
   13213.695     0.999998      1611755    524288.00
   13221.887     0.999998      1611756    582542.22
   13221.887     0.999998      1611756    655360.00
   13221.887     0.999999      1611756    748982.86
   13230.079     0.999999      1611757    873813.33
   13230.079     0.999999      1611757   1048576.00
   13230.079     0.999999      1611757   1165084.44
   13230.079     0.999999      1611757   1310720.00
   13230.079     0.999999      1611757   1497965.71
   13238.271     0.999999      1611758   1747626.67
   13238.271     1.000000      1611758          inf
#[Mean    =     6493.650, StdDeviation   =     2900.007]
#[Max     =    13230.080, Total count    =      1611758]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1939952 requests in 1.00m, 3.96GB read
Requests/sec:  32333.72
Transfer/sec:     67.53MB

JSON Output:
{
	"requests": 1939952,
	"duration_in_microseconds": 59997801.00,
	"bytes": 4248494880,
	"requests_per_sec": 32333.72,
	"bytes_transfer_per_sec": 70810843.22,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 6381567
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 8855551
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 10559487
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 12230655
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 12795903
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 13025279
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 13139967
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 13238271
		}
	]
}